In [2]:
import sqlite3
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [3]:
# Connect to the SQLite database
conn = sqlite3.connect('Cuisine_data.db')

# Query the database
query = "SELECT * FROM CuisineRating;"

In [4]:
# Load the data into a pandas DataFrame
df = pd.read_sql(query, conn)

# Display the first few rows of the DataFrame
df.head()

,UserID,AreaCode,Location,Gender,YOB,MaritalStatus,Activity,Budget,Cuisines,Alcohol,Smoker,FoodRating,ServiceRating,OverallRating,OftenAS
0,1,153,"Upper East Side,NY",Female,2006,Single,Professional,3,Japanese,Never,Never,5,4,4.5,No
1,2,123,"St. George,NY",Female,1991,Married,Student,3,Indian,Never,Socially,1,1,1.0,No
2,3,122,"Upper West Side,NY",Male,1977,Single,Student,5,Seafood,Often,Often,5,5,5.0,Yes
3,4,153,"Upper East Side,NY",Female,1956,Married,Professional,5,Japanese,Never,Socially,3,1,2.0,No
4,5,129,"Central Park,NY",Male,1997,Single,Student,4,Filipino,Socially,Never,2,4,3.0,No